Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateSlabEdge Property
 Could not create Slab Edge. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateSlabEdge { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateSlabEdge As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateSlabEdge {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace